app/controllers/admin/csv_output_controller.rb

  def index
    @outputs = CsvOutput.find(:all, :conditions => ["input_server_name = ?", "dev"])
    return unless request.post?
    school_id = params[:school_id]
    server_name = params[:server_id]
    project_name = params[:project_id]
    sort = params[:sort]
    upflag = params[:upflag].to_s == "1"
    return flash[:notice] = "加盟校IDを入力してください。" if school_id.blank?
    if upflag
      import_server_name = params[:import_server_id]
      #admin_mark = params[:admin_mark_guid]
      #return flash[:notice] = "標識IDが不正です。" if admin_mark != session[:admin_mark_guid]
      CsvInput.input(school_id, server_name, project_name, import_server_name)
      flash[:notice] = "データを更新しました。"
    else
      #admin_mark = session[:admin_mark_guid]
      return_error = CsvOutput.output(school_id, server_name, project_name)
      return flash[:notice] = "加盟校IDが不正です。" if return_error == "error001"
      output = CsvOutput.find(:first, :conditions => ["project_name = ? and server_name = ? and school_id = ? and output_flag = ? and input_server_name = ? and sort = ?", project_name, server_name, school_id, true, "dev", sort])
      CsvOutput.create(:project_name => project_name, :server_name => server_name, :school_id => school_id, :output_flag => true, :input_server_name => "dev", :sort => sort) if output.blank?
---
SELECT * FROM "csv_outputs" WHERE (project_name = 'schoolcity' and server_name = 'dev' and school_id = '17' and output_flag = 't') LIMIT 1
INSERT INTO "csv_outputs" ("server_name", "created_at", "output_flag", "updated_at", "input_flag", "user_ids", "deleted", "project_name", "course_ids", "school_id") VALUES('dev', '2013-08-08 05:45:28', 't', '2013-08-08 05:45:28', 'f', NULL, 'f', 'schoolcity', NULL, 17)
INSERT INTO `csv_inputs` (`server_name`, `created_at`, `input_flag`, `updated_at`, `user_ids`, `deleted`, `project_name`, `course_ids`, `school_id`) VALUES('local', '2013-07-12 02:18:50', 1, '2013-07-12 02:18:50', NULL, 0, 'schoolcity', NULL, 4)

  def benfan
    @outputs = CsvOutput.find(:all, :conditions => ["input_server_name = ?", "benfan"])
---
SELECT * FROM "csv_outputs" WHERE (server_name = 'benfan')

  def local
    @outputs = CsvOutput.find(:all, :conditions => ["input_server_name = ?", "local"])
    return unless request.post?
    school_id = params[:school_id]
    server_name = params[:server_id]
    project_name = params[:project_id]
    sort = params[:sort]
    upflag = params[:upflag].to_s == "1"
    return flash[:notice] = "加盟校IDを入力してください。" if school_id.blank?
    if upflag
      import_server_name = params[:import_server_id]
      #admin_mark = params[:admin_mark_guid]
      #return flash[:notice] = "標識IDが不正です。" if admin_mark != session[:admin_mark_guid]
      CsvInput.input(school_id, server_name, project_name, import_server_name)
      flash[:notice] = "データを更新しました。"
    else
      #admin_mark = session[:admin_mark_guid]
      return_error = CsvOutput.output(school_id, server_name, project_name)
      return flash[:notice] = "加盟校IDが不正です。" if return_error == "error001"
      output = CsvOutput.find(:first, :conditions => ["project_name = ? and server_name = ? and school_id = ? and output_flag = ? and input_server_name = ? and sort = ?", project_name, server_name, school_id, true, "local", sort])
      CsvOutput.create(:project_name => project_name, :server_name => server_name, :school_id => school_id, :output_flag => true, :input_server_name => "local", :sort => sort) if output.blank?
---
SELECT * FROM "csv_outputs" WHERE (project_name = 'schoolcity' and server_name = 'local' and school_id = '67' and output_flag = 't' and input_server_name = 'local') LIMIT 1
INSERT INTO "csv_outputs" ("server_name", "created_at", "output_flag", "input_time", "updated_at", "input_flag", "user_ids", "deleted", "project_name", "course_ids", "input_server_name", "school_id") VALUES('local', '2013-08-19 22:16:08', 't', NULL, '2013-08-19 22:16:08', 'f', NULL, 'f', 'schoolcity', NULL, 'local', 67)
SELECT * FROM "csv_outputs"

  def import
    output = CsvOutput.find_by_id(params[:id])
    return redirect_to :action => "index" if output.blank?
    school_id = output.school_id
    server_name = output.server_name
    project_name = output.project_name
    sort = params[:sort]
    import_server_name = params[:import_server_id]
    puts '==============='
    puts 'will import now'
    CsvInput.input(school_id, server_name, project_name, import_server_name, sort)
    output.input_flag = true
    output.save(false)
---
SELECT * FROM "csv_outputs" WHERE (school_id = 67 and project_name = 'schoolcity' and server_name = 'local' and input_server_name = 'local') LIMIT 1
UPDATE "csv_outputs" SET "updated_at" = '2013-08-19 22:17:02', "input_time" = '2013-08-19 22:17:02' WHERE "id" = 9